{"class_name": "Model", "config": {"name": "model_9", "layers": [{"name": "char_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 52], "dtype": "float32", "sparse": false, "name": "char_input"}, "inbound_nodes": []}, {"name": "casing_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "int32", "sparse": false, "name": "casing_input"}, "inbound_nodes": []}, {"name": "char_embedding", "class_name": "TimeDistributed", "config": {"name": "char_embedding", "trainable": true, "layer": {"class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 334, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.5, "maxval": 0.5, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}}, "inbound_nodes": [[["char_input", 0, 0, {}]]]}, {"name": "words_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 300], "dtype": "float32", "sparse": false, "name": "words_input"}, "inbound_nodes": []}, {"name": "case_embed", "class_name": "Embedding", "config": {"name": "case_embed", "trainable": false, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["casing_input", 0, 0, {}]]]}, {"name": "time_distributed_17", "class_name": "TimeDistributed", "config": {"name": "time_distributed_17", "trainable": true, "layer": {"class_name": "Bidirectional", "config": {"name": "bidirectional_17", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "char_lstm", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 50, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}}, "merge_mode": "concat"}}}, "inbound_nodes": [[["char_embedding", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "axis": -1}, "inbound_nodes": [[["words_input", 0, 0, {}], ["case_embed", 0, 0, {}], ["time_distributed_17", 0, 0, {}]]]}, {"name": "bidirectional_18", "class_name": "Bidirectional", "config": {"name": "bidirectional_18", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "token_lstm", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 200, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "time_distributed_18", "class_name": "TimeDistributed", "config": {"name": "time_distributed_18", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "token_dense", "trainable": true, "units": 26, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["bidirectional_18", 0, 0, {}]]]}, {"name": "crf", "class_name": "ClassWrapper", "config": {"name": "crf", "trainable": true, "units": 26, "learn_mode": "join", "test_mode": "viterbi", "use_boundary": true, "use_bias": true, "sparse_target": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "chain_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "boundary_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": null, "chain_regularizer": null, "boundary_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "chain_constraint": null, "boundary_constraint": null, "bias_constraint": null, "input_dim": 26, "unroll": false}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]]}], "input_layers": [["words_input", 0, 0], ["casing_input", 0, 0], ["char_input", 0, 0]], "output_layers": [["crf", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}